Revit 2024 API
DockablePaneState Constructor (DockablePaneState)
 Constructs a new copy of the input DockablePaneState object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public DockablePaneState(
	DockablePaneState other
)
Visual Basic
Public Sub New ( _
	other As DockablePaneState _
)
Visual C++
public:
DockablePaneState(
	DockablePaneState^ other
)
Parameters
other
Type: Autodesk.Revit.UI.DockablePaneState
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DockablePaneState Class
DockablePaneState Overload
Autodesk.Revit.UI Namespace